v = [
    ['Макао',84.98,73734],
['Япония',84.83,44292],
['Сан-Марино',83.86,65718],
['Канада',83.80,55635],
['Исландия',83.64,61481],
['Андорра',83.42,58830],
['Израиль',83.35,46127],
['Швейцария',83.23,81603],
['Мальта',83.20,53387],
['Австралия',83.09,57406],
['Южная Корея',82.97,48595],
['Швеция',82.70,63375],
['Франция',82.59,53835],
['Италия',82.59,49913],
['Норвегия',82.55,104459],
['Испания',82.55,43621],
['Новая Зеландия',82.54,48556],
['Австрия',82.27,63421],
['Объединенное Королевство',81.94,52842],
['Бельгия',81.86,62107],
['Словения',81.82,46502],
['Финляндия',81.76,57849],
['Пуэрто-Рико',81.68,41642],
['Дания',81.66,69879],
['Германия',81.51,61940],
['Португалия',81.50,38783],
['Греция',81.49,33018],
['Тайвань',81.16,69151],
['Острова Теркс и Кайкос',80.82,21803],
['Соединенные Штаты',80.59,70219],
['Бахрейн',79.90,54352],
['Катар',79.81,108865],
['Чили',79.79,29148],
['Кипр',79.74,48469],
['Чехия',79.73,48418],
['Коста-Рика',79.64,23700],
['Объединенные Арабские Эмираты',79.56,68913],
['Албания',79.47,16263],
['Кюрасао',79.42,25164],
['Синт-Мартен',79.26,39466],
['Кувейт',79.13,48130],
['Сент-Люсия',78.95,19936],
['Ливан',78.76,11860],
['Польша',78.76,40463],
['Барбадос',78.55,14686],
['Уругвай',78.43,29501],
['Бруней',78.38,79364],
['Парагвай',78.37,15361],
['Аргентина',78.31,26087],
['Словакия',78.31,37795],
['Доминика',78.21,14472],
['Алжир',78.03,12893],
['Аруба',78.01,38226],
['Эквадор',78.00,13293],
['Шри-Ланка',78.00,14306],
['Босния и Герцеговина',77.98,18380],
['Эстония',77.88,45047],
['Антигуа и Барбуда',77.80,25493],
['Черногория',77.75,24511],
['Китай',77.72,20407],
['Таиланд',77.66,20253],
['Панама',77.62,30896],
['Тонга',77.53,6779],
['Грузия',77.50,18691],
['Хорватия',77.22,36954],
['Венгрия',77.20,38644],
['Ливия',77.18,15134],
['Сент-Китс и Невис',77.08,26419],
['Мальдивы',76.94,18866],
['Оман',76.90,38931],
['Северная Македония',76.84,19903],
['Тунис',76.82,12127],
['Соломоновы острова',76.70,2645],
['Сент-Винсент и Гренадины',76.68,15674],
['Саудовская Аравия',76.65,47754],
['Турция',76.21,31638],
['Армения',76.13,16899],
['Багамские острова',76.13,28910],
['Малайзия',76.13,30456],
['Сейшельские острова',76.10,25938],
['Иордания',76.01,9115],
['Бразилия',75.92,17451],
['Латвия',75.91,36778],
['Белиз',75.82,11860],
['Литва',75.78,46410],
['Ямайка',75.75,9611],
['Румыния',75.75,37971],
['Гренада',75.74,14326],
['Болгария',75.57,29407],
['Вьетнам',75.52,12219],
['Сальвадор',75.37,10860],
['Узбекистан',75.29,8162],
['Иран',75.25,15042],
['Самоа',75.19,6107],
['Гондурас',75.17,6286],
['Вануату',75.14,3090],
['Колумбия',74.89,17587],
['Маврикий',74.86,22738],
['Никарагуа',74.78,6875],
['Бангладеш',74.70,7367],
['Маршалловы острова',74.65,6594],
['Палау',74.64,15573],
['Египет',74.45,15821],
['Беларусь',74.28,27611],
['Фиджи',74.27,10594],
['Сербия',74.17,22575],
['Азербайджан',74.15,20111],
['Кабо-Верде',73.75,6576],
['Марокко',73.68,8581],
['Украина',73.45,18040],
['Венесуэла',73.29,7259],
['Индонезия',73.08,12476],
['Гватемала',72.91,12106],
['Казахстан',72.53,34236],
['Боливия',72.50,9343],
['Малави',72.44,1732],
['Молдова',72.44,15682],
['Россия',72.44,38971],
['Суринам',72.42,18447],
['Непал',72.40,4462],
['Кыргызстан',72.35,5802],
['Мексика',72.32,21124],
['Бутан',72.31,13423],
['Гайана',71.87,23176],
['Туркменистан',71.83,19059],
['Монголия',71.37,14951],
['Того',71.36,2679],
['Косово',71.12,12363],
['Камбоджа',70.65,4668],
['Танзания',70.19,3451],
['Филиппины',70.14,8797],
['Сенегал',69.96,4266	],
['Тимор-Лешти',69.92,6970],
['Габон',69.70,19552],
['Кения',69.69,5360],
['Пакистан',69.67,5555],
['Папуа - Новая Гвинея',69.43,4014],
['Гана',69.37,6544],
['Таджикистан',69.36,4075],
['Уганда',68.96,2688],
['Перу',68.94,14854],
['Тувалу',68.38,5081],
['Эфиопия',68.25,2628],
['Мадагаскар',68.17,1642],
['Лаос',68.15,8111],
['Науру',67.93,12127],
['Кирибати',67.90,2216],
['Гамбия',67.60,2291],
['Йемен',67.51,2021],
['Бурунди',67.42,864],
['Индия',67.22,8045],
['Судан',67.12,3421],
['Сан-Томе и Принсипи',67.06,5703],
['Эритрея',66.85,2086],
['Намибия',66.47,10823],
['Замбия',66.26,3527],
['Гаити',65.95,3115],
['Руанда',65.85,2706],
['Ботсвана',65.64,16652],
['Либерия',65.45,1557],
['Южная Африка',65.32,14173],
['Джибути',65.30,6032],
['Мавритания',65.22,5988],
['Гвинея',63.90,3735],
['Экваториальная Гвинея',63.70,17937],
['Гвинея-Бисау',63.68,2697],
['Буркина-Фасо',63.44,2468],
['Зимбабве',63.32,3276],
['Камерун',63.27,4472],
['Мали',62.41,2340],
["Кот-д'Ивуар",62.26,6433],
['Бенин',62.21,3575],
['Ангола',62.11,7414],
['Конго, Республика',62.10,6714],
['Демократическая Республика Конго',61.83,1385],
['Нигерия',61.33,5624],
['Нигер',60.09,1539],
['Эсватини',59.69,10203	],
['Лесото',59.57,2456],
['Южный Судан',59.16,484],
['Чад',59.15,1764],
['Сьерра-Леоне',58.76,1624],
['Мозамбик',57.10,1441],
['Сомали',55.72,1462],
['Афганистан',53.65,2139]
]

import matplotlib.pyplot as pplt

print('Country; Age; GDP')
for i in v:
    print(''+str(i[0])+';'+str(i[1]).replace('.',',')+';'+str(i[2]))


sx = 0
sy = 0
sxx = 0
syy = 0
sxy = 0


import math

for i in v:

    i.append(i[1]*i[1])
    i.append(i[2] * i[2])
    i.append(i[1]*i[2])
    # Name, x, y, x*x, y*y, x*y

    sx += i[1]
    sy += i[2]
    sxx += i[3]
    syy += i[4]
    sxy += i[5]

n = len(v)
mx = sx / n
my = sy / n
mxx = sxx / n
myy = syy / n
mxy = sxy / n

skox = math.sqrt(mxx-mx*mx)
skoy = math.sqrt(myy-my*my)
r = (mxy-mx*my)/(skox*skoy)

print()
print('Коэффициент корреляции r = '+str(r))
print('Коэффициент детерминации R^2 =' + str(r*r))

lifespan = [_d[1] for _d in v]
# и тепературами
gdp = [_d[2] for _d in v]
pplt.scatter(lifespan, gdp)
pplt.xlabel("Средняя продолжительность жизни")
pplt.ylabel("ВВП по ППС на душу населения")
pplt.show()
